InformationRegisters/РассылкаСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РассылкаСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолучательАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучательПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вложения</Name>
					<Comment>Массив вложений письма</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщенияIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРассылки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПостановкиВОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РассылкаСообщений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РассылкиСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтчетныйПериодСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОтправкиСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыРассылки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РассылкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РассылкиСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРассылокСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассылки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РассылкаСообщений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ДанныеСостоянияРассылкиСообщенийВФоне", Истина);
	
КонецПроцедуры

// Создает новый элемент рассылки и записывает очередь сообщений по этой рассылке
//
// Параметры:
//  ПараметрыРассылки - Структура - см. Справочники.РассылкиСообщений.НовыйДанныеЗаполнения()
//  СпециальныеПараметрыРассылки - Структура - любые данные, специфичные для конкретного вида рассылки
//
// Возвращаемое значение:
//  СправочникСсылка.РассылкиСообщений - Ссылка на рассылку 
//
Функция ЗарегистрироватьОчередьРассылкиСообщений(ПараметрыРассылки, СпециальныеПараметрыРассылки = Неопределено) Экспорт
	
	ДанныеЗаполнения = Справочники.РассылкиСообщений.НовыйДанныеЗаполнения();
	
	ДанныеЗаполнения.Наименование =  СтрШаблон(НСтр("ru = 'Рассылка сообщений от %1'"), ТекущаяДатаСеанса());
	ДанныеЗаполнения.ВидРассылки =   ПараметрыРассылки.ВидРассылки;
	ДанныеЗаполнения.УчетнаяЗапись = ПараметрыРассылки.УчетнаяЗапись;
	
	Если ТипЗнч(СпециальныеПараметрыРассылки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, СпециальныеПараметрыРассылки);
	КонецЕсли;

	РассылкаСообщенийПереопределяемый.ПередДобавлениемРассылки(
		ДанныеЗаполнения, ПараметрыРассылки, СпециальныеПараметрыРассылки);

	Рассылка = Справочники.РассылкиСообщений.НоваяРассылка(ДанныеЗаполнения);
	
	Если Не ЗначениеЗаполнено(Рассылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыРассылки.РассылкаСообщений = Рассылка;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РассылкаСообщений.Установить(Рассылка);
	
	РассылкаСообщенийПереопределяемый.РегистрацияОчередиРассылки(
		НаборЗаписей, ПараметрыРассылки, СпециальныеПараметрыРассылки);
	
	МоментИзменения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если НаборЗаписей.Количество() > 0 Тогда
		Для Каждого Запись Из НаборЗаписей Цикл
			Если ЗначениеЗаполнено(Запись.МоментИзменения) Тогда
				Продолжить;
			КонецЕсли;
			Запись.МоментИзменения = МоментИзменения;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЕсли;
	
	Возврат Рассылка;
	
КонецФункции

// Записывает состояние "Отправлено" по конкретному получателю
//
// Параметры:
//  СтрокаРассылки - СтрокаТаблицыЗначений  - колонки соответствуют свойствам регистра сведений РассылкаСообщений
//  ПараметрыОтправки - Структура - см. РассылкаСообщений.НовыйПараметрыОтправкиСообщений()
//
Процедура ЗарегистрироватьУспешнуюОтправку(СтрокаРассылки, ПараметрыОтправки) Экспорт
	
	Состояние = Перечисления.СтатусыРассылки.Отправлено;
	ЗаписатьСостояниеОтправки(СтрокаРассылки, Состояние, ПараметрыОтправки);
	
КонецПроцедуры

// Записывает состояние "Не удалось отправить" по конкретному получателю
//
// Параметры:
//  СтрокаРассылки - СтрокаТаблицыЗначений  - колонки соответствуют свойствам регистра сведений РассылкаСообщений
//  ТекстОшибки - Строка - текст ошибки для записи
//  ПараметрыОтправки - Структура - см. РассылкаСообщений.НовыйПараметрыОтправкиСообщений()
//
Процедура ЗарегистрироватьОшибкуПриОтправке(СтрокаРассылки, ТекстОшибки, ПараметрыОтправки) Экспорт
	
	Состояние = Перечисления.СтатусыРассылки.Ошибка;
	ЗаписатьСостояниеОтправки(СтрокаРассылки, Состояние, ПараметрыОтправки, ТекстОшибки);
	
КонецПроцедуры

// Записывает ошибку отправки и ставит сообщение в конец очереди на отправку.
//
// Параметры:
//  СтрокаРассылки - СтрокаТаблицыЗначений  - колонки соответствуют свойствам регистра сведений РассылкаСообщений
//  ТекстОшибки - Строка - текст ошибки для записи
//  ПараметрыОтправки - Структура - см. РассылкаСообщений.НовыйПараметрыОтправкиСообщений()
//
Процедура ЗарегистрироватьОшибкуПриОтправкеИПоставитьВКонецОчереди(СтрокаРассылки, ТекстОшибки, ПараметрыОтправки) Экспорт
	
	Состояние = Перечисления.СтатусыРассылки.Ожидание;
	ЗаписатьСостояниеОтправки(СтрокаРассылки, Состояние, ПараметрыОтправки, ТекстОшибки);
	
КонецПроцедуры

// Возвращает список рассылок, по которым есть неотправленные сообщения
//
// Параметры:
//  СпособыОтправки - Массив из ПеречислениеСсылка.СпособыОтправкиСообщений- массив способов отправки
//  ПараметрыОтправки - Структура - см. РассылкаСообщений.НовыйПараметрыОтправкиСообщений()
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.РассылкиСообщений - список незавершенных рассылок
//
Функция НезавершенныеРассылкиДляОтправки(СпособыОтправки, ПараметрыОтправки) Экспорт
	
	НезавершенныеРассылки = Справочники.РассылкиСообщений.НезавершенныеРассылки();
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ПредельноеКоличествоПопытокОтправкиПисьма",
		ПараметрыОтправки.КоличествоПопытокОтправкиПисьма);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("НезавершенныеРассылки", НезавершенныеРассылки);
	Запрос.УстановитьПараметр("СпособыОтправки", СпособыОтправки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Рассылка.Ссылка КАК Ссылка,
	|	Рассылка.ДатаРассылки КАК ДатаРассылки
	|ИЗ
	|	Справочник.РассылкиСообщений КАК Рассылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаСообщений КАК СостоянияРассылкиСообщений
	|		ПО Рассылка.Ссылка = СостоянияРассылкиСообщений.РассылкаСообщений
	|		И СостоянияРассылкиСообщений.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыРассылки.Ожидание)
	|		И СостоянияРассылкиСообщений.ВыполненоПопытокОтправки <= &ПредельноеКоличествоПопытокОтправкиПисьма
	|		И СостоянияРассылкиСообщений.СпособОтправки В (&СпособыОтправки)
	|ГДЕ
	|	Рассылка.Ссылка В (&НезавершенныеРассылки)
	|	И Рассылка.СледующаяПопытка <= &ТекущаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Рассылка.ДатаРассылки";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Определяет, есть ли сообщения к отправке
//
// Возвращаемое значение:
//  Булево - Истина, если есть сообщения к отправке
//
Функция ОтсутствуютДанныеДляОтправки() Экспорт
	
	НезавершенныеРассылки = Справочники.РассылкиСообщений.НезавершенныеРассылки();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияРассылкиСообщений.РассылкаСообщений КАК РассылкаСообщений
	|ИЗ
	|	РегистрСведений.РассылкаСообщений КАК СостоянияРассылкиСообщений
	|ГДЕ
	|	СостоянияРассылкиСообщений.РассылкаСообщений В (&НезавершенныеРассылки)
	|	И СостоянияРассылкиСообщений.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыРассылки.Ожидание)";
	
	Запрос.УстановитьПараметр("НезавершенныеРассылки", НезавершенныеРассылки);
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

// Записывает состояние "Отменено" по всем сообщениям переданных рассылок
//
// Параметры:
//  НезавершенныеРассылки - Массив из СправочникСсылка.РассылкиСообщений - массив рассылок
//
Процедура ЗарегистрироватьОтменуОтправки(НезавершенныеРассылки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияРассылкиСообщений.РассылкаСообщений КАК РассылкаСообщений,
	|	СостоянияРассылкиСообщений.Получатель КАК Получатель,
	|	СостоянияРассылкиСообщений.Организация КАК Организация,
	|	СостоянияРассылкиСообщений.ОтчетныйПериодСообщения КАК ОтчетныйПериодСообщения,
	|	СостоянияРассылкиСообщений.СпособОтправки КАК СпособОтправки
	|ИЗ
	|	РегистрСведений.РассылкаСообщений КАК СостоянияРассылкиСообщений
	|ГДЕ
	|	СостоянияРассылкиСообщений.РассылкаСообщений В (&НезавершенныеРассылки)
	|	И СостоянияРассылкиСообщений.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыРассылки.Ожидание)";
	
	Запрос.УстановитьПараметр("НезавершенныеРассылки", НезавершенныеРассылки);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Состояние = Перечисления.СтатусыРассылки.Отменено;
	Пока Выборка.Следующий() Цикл
		ЗаписатьСостояниеОтправки(Выборка, Состояние, Новый Структура);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Количество попыток отправки письма
// 
// Возвращаемое значение:
//  Число - Количество попыток
Функция КоличествоПопытокОтправкиПисьма() Экспорт
	
	Возврат 5;
	
КонецФункции

// Возвращает состояние рассылки сообщений: данные баннера (текст баннера, цвет баннера, картинка и т.д.)
// и измененные записи расслыки с момента прошлого обращения (если запрошены).
//
// Параметры:
//  ПараметрыЗадания - Структура - Параметры выполнения, могут быть переданы НезавершенныеРассылки.
//                                 Если указано свойство ВыбиратьИзменения = Истина, то в результат
//                                 будут добавлены записи очереди, измененные с ГраницаАктуальности.
//  АдресХранилища	 - Строка - Адрес хранилища, в который будет возвращен результат.
//
Процедура ДанныеСостоянияРассылкиСообщенийВФоне(ПараметрыЗадания, АдресХранилища) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Баннер");
	Результат.Вставить("Изменения");
	
	НезавершенныеРассылки = Неопределено;
	ВыбиратьИзменения = Ложь;
	ГраницаАктуальности = 0;
	
	ПараметрыЗадания.Свойство("НезавершенныеРассылки", НезавершенныеРассылки);
	ПараметрыЗадания.Свойство("ВыбиратьИзменения", ВыбиратьИзменения);
	ПараметрыЗадания.Свойство("ГраницаАктуальности", ГраницаАктуальности);
	
	ОписаниеРассылкиСообщений = ОписаниеРассылкиСообщений(НезавершенныеРассылки);
	Если ОписаниеРассылкиСообщений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат.Баннер = ДанныеБаннераРассылкиСообщений(ОписаниеРассылкиСообщений);
	
	Если ЗначениеЗаполнено(НезавершенныеРассылки) И ВыбиратьИзменения Тогда
		// Граница актуальности также может быть изменена на основе метки времени изменных записей
		Результат.Вставить("Изменения", ИзмененияОчереди(НезавершенныеРассылки, ГраницаАктуальности));
		Результат.Вставить("ГраницаАктуальности", ГраницаАктуальности);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

// Конструктор данных баннера рассылки сообщений
//
// Возвращаемое значение:
//  Структура - данные баннера рассылки сообщений. Свойства:
//  *ТекстБаннера - Строка - текст баннера
//  *ИмяКартинкиБаннера - Строка - имя картинки баннера
//  *ИнтервалПроверкиСостоянияРассылкиСообщений - Число - интервал проверки состояния рассылки сообщений
//  *ЦветБаннера - Цвет - цвет баннера
//  *КартинкаЗакрытьБаннер - Булево - признак того, что нужно показать картинку закрыть баннер
//  *РассылкаЗавершена - Булево - признак того, что рассылка завершена	
//
Функция НовыйДанныеБаннера() Экспорт
	
	ДанныеБаннера = Новый Структура();
	ДанныеБаннера.Вставить("ТекстБаннера", "");
	ДанныеБаннера.Вставить("ИмяКартинкиБаннера", "СинхронизацияДанныхДлительнаяОперация");
	ДанныеБаннера.Вставить("ИнтервалПроверкиСостоянияРассылкиСообщений", 0);
	ДанныеБаннера.Вставить("ЦветБаннера", ЦветаСтиля.ЦветБаннераБежевый);
	ДанныеБаннера.Вставить("КартинкаЗакрытьБаннер", Истина);
	ДанныеБаннера.Вставить("РассылкаЗавершена", Ложь);
	
	Возврат ДанныеБаннера;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИзмененияОчереди(НезавершенныеРассылки, ГраницаАктуальности)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостояниеРассылки.РассылкаСообщений КАК РассылкаСообщений,
	|	СостояниеРассылки.Получатель КАК Получатель,
	|	СостояниеРассылки.Организация КАК Организация,
	|	СостояниеРассылки.ОтчетныйПериодСообщения КАК ОтчетныйПериодСообщения,
	|	СостояниеРассылки.СпособОтправки КАК СпособОтправки,
	|	СостояниеРассылки.Состояние КАК Состояние,
	|	СостояниеРассылки.ТекстОшибки КАК ТекстОшибки,
	|	СостояниеРассылки.ДатаОтправки КАК ДатаОтправки,
	|	СостояниеРассылки.ВыполненоПопытокОтправки КАК ВыполненоПопытокОтправки,
	|	СостояниеРассылки.МоментИзменения КАК МоментИзменения
	|ПОМЕСТИТЬ ИзмененияРассылки
	|ИЗ
	|	РегистрСведений.РассылкаСообщений КАК СостояниеРассылки
	|ГДЕ
	|	СостояниеРассылки.РассылкаСообщений В (&НезавершенныеРассылки)
	|	И СостояниеРассылки.МоментИзменения > &ГраницаАктуальности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзмененияРассылки.РассылкаСообщений КАК РассылкаСообщений,
	|	ИзмененияРассылки.Получатель КАК Получатель,
	|	ИзмененияРассылки.Организация КАК Организация,
	|	ИзмененияРассылки.ОтчетныйПериодСообщения КАК ОтчетныйПериодСообщения,
	|	ИзмененияРассылки.СпособОтправки КАК СпособОтправки,
	|	ИзмененияРассылки.Состояние КАК Состояние,
	|	ИзмененияРассылки.ТекстОшибки КАК ТекстОшибки,
	|	ИзмененияРассылки.ДатаОтправки КАК ДатаОтправки,
	|	ИзмененияРассылки.ВыполненоПопытокОтправки КАК ВыполненоПопытокОтправки
	|ИЗ
	|	ИзмененияРассылки КАК ИзмененияРассылки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИзмененияРассылки.МоментИзменения) КАК ГраницаАктуальности
	|ИЗ
	|	ИзмененияРассылки КАК ИзмененияРассылки";
	
	Запрос.УстановитьПараметр("НезавершенныеРассылки", НезавершенныеРассылки);
	Запрос.УстановитьПараметр("ГраницаАктуальности", ГраницаАктуальности);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаРезультат = РезультатЗапроса[1].Выгрузить();
	
	ВыборкаГраницаАктуальности = РезультатЗапроса[2].Выбрать();
	
	Если ВыборкаГраницаАктуальности.Следующий()
		 И ЗначениеЗаполнено(ВыборкаГраницаАктуальности.ГраницаАктуальности) Тогда
		ГраницаАктуальности = ВыборкаГраницаАктуальности.ГраницаАктуальности;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультат);
	
КонецФункции

Процедура ЗаписатьСостояниеОтправки(СтрокаРассылки, Состояние, ПараметрыОтправки, ТекстОшибки = Неопределено)
	
	Попытка
		
		Запись = СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(Запись, СтрокаРассылки, 
			"РассылкаСообщений, Получатель, Организация, ОтчетныйПериодСообщения, СпособОтправки"); // все измерения
		
		Запись.Прочитать();
		Запись.Состояние = Состояние;
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			Запись.ТекстОшибки = ТекстОшибки;
		Иначе
			Запись.ТекстОшибки = "";
		КонецЕсли;
		
		Если Состояние = Перечисления.СтатусыРассылки.Отправлено Тогда
			Запись.ИдентификаторСообщения = СтрокаРассылки.ИдентификаторСообщения;
			Запись.ИдентификаторСообщенияIMAP = СтрокаРассылки.ИдентификаторСообщенияIMAP;
			Запись.ДатаОтправки = ТекущаяУниверсальнаяДата();
		КонецЕсли;
		
		Если Состояние = Перечисления.СтатусыРассылки.Ожидание Тогда
			Запись.ДатаПостановкиВОчередь = ТекущаяУниверсальнаяДата();
			Запись.ВыполненоПопытокОтправки = Запись.ВыполненоПопытокОтправки + 1;
		КонецЕсли;
		
		Если Состояние = Перечисления.СтатусыРассылки.Ожидание
			И Запись.ВыполненоПопытокОтправки > ПараметрыОтправки.КоличествоПопытокОтправкиПисьма Тогда
			Запись.Состояние = Перечисления.СтатусыРассылки.Ошибка;
			Запись.ТекстОшибки = СтрШаблон(НСтр("ru = 'Превышено количество попыток отправки: %1'"),
				ПараметрыОтправки.КоличествоПопытокОтправкиПисьма);
		КонецЕсли;
		
		Если Состояние = Перечисления.СтатусыРассылки.Отправлено 
			 Или Состояние = Перечисления.СтатусыРассылки.Ошибка
			 Или Состояние = Перечисления.СтатусыРассылки.Отменено Тогда
			// Очистим данные для подготовки письма - они более не понадобятся
			Запись.Вложения  = Неопределено;
		КонецЕсли;
		
		Запись.МоментИзменения = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Запись.Записать();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			РассылкаСообщений.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

#Область БаннерСостояниеРассылкиСообщений

Функция ОписаниеРассылкиСообщений(НезавершенныеРассылки)
	
	ОписаниеРассылкиСообщений = НовыйОписаниеРассылкиСообщений();
	
	Если НезавершенныеРассылки = Неопределено Тогда
		// Не указан массив отобранных незавершенных рассылок, поэтому выберем все виды незавершенных рассылок.
		// В данном случае считаем, что вызов функции выполнен из формы состояния рассылки сообщений,
		// поэтому требуется подробное описание состояния рассылки и баннер не закрывается.
		НезавершенныеРассылки = Справочники.РассылкиСообщений.НезавершенныеРассылки();
		Если Не ЗначениеЗаполнено(НезавершенныеРассылки) Тогда
			Возврат Неопределено;
		КонецЕсли;
		ОписаниеРассылкиСообщений.ФормаСостоянияРассылкиСообщений = Истина;
		ОписаниеРассылкиСообщений.МожноЗакрытьБаннер = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НезавершенныеРассылки) Тогда
		Возврат ОписаниеРассылкиСообщений;
	КонецЕсли;
	
	// Часть данных берем из первой незавершенной рассылки (будет наиболее ранняя по времени), т.к. обработка
	// рассылок также выполняется в хронологическом порядке.
	ДанныеРассылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НезавершенныеРассылки[0], "ДатаРассылки, СледующаяПопытка");
	ОписаниеРассылкиСообщений.ДатаРассылки = ДанныеРассылки.ДатаРассылки;
	ОписаниеРассылкиСообщений.СледующаяПопытка = ДанныеРассылки.СледующаяПопытка;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(СостоянияРассылкиСообщений.Состояние) КАК Количество,
	|	СостоянияРассылкиСообщений.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.РассылкаСообщений КАК СостоянияРассылкиСообщений
	|ГДЕ
	|	СостоянияРассылкиСообщений.РассылкаСообщений В(&НезавершенныеРассылки)
	|	И СостоянияРассылкиСообщений.Состояние <> ЗНАЧЕНИЕ(Перечисление.СтатусыРассылки.Отменено)
	|
	|СГРУППИРОВАТЬ ПО
	|	СостоянияРассылкиСообщений.Состояние";
	
	Запрос.УстановитьПараметр("НезавершенныеРассылки", НезавершенныеРассылки);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Состояние = Перечисления.СтатусыРассылки.Отправлено Тогда
			ОписаниеРассылкиСообщений.Отправлено = Выборка.Количество;
		ИначеЕсли Выборка.Состояние = Перечисления.СтатусыРассылки.Ожидание Тогда
			ОписаниеРассылкиСообщений.ВОчередиНаОтправку = Выборка.Количество;
		ИначеЕсли Выборка.Состояние = Перечисления.СтатусыРассылки.Ошибка Тогда
			ОписаниеРассылкиСообщений.НеУдалосьОтправить = Выборка.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписаниеРассылкиСообщений;
	
КонецФункции

Функция НовыйОписаниеРассылкиСообщений()
	
	ОписаниеРассылкиСообщений = Новый Структура();
	
	ОписаниеРассылкиСообщений.Вставить("ДатаРассылки",        '00010101');
	ОписаниеРассылкиСообщений.Вставить("Отправлено",          0);
	ОписаниеРассылкиСообщений.Вставить("ВОчередиНаОтправку",  0);
	ОписаниеРассылкиСообщений.Вставить("НеУдалосьОтправить",  0);
	ОписаниеРассылкиСообщений.Вставить("СледующаяПопытка",    '00010101');
	ОписаниеРассылкиСообщений.Вставить("МожноЗакрытьБаннер",  Истина);
	ОписаниеРассылкиСообщений.Вставить("ФормаСостоянияРассылкиСообщений", Ложь);
	ОписаниеРассылкиСообщений.Вставить("ГраницаАктуальности", 0);
	
	Возврат ОписаниеРассылкиСообщений;
	
КонецФункции

Функция ДанныеБаннераРассылкиСообщений(Описание)
	
	ДанныеБаннера = НовыйДанныеБаннера();
	
	ДанныеБаннера.ТекстБаннера = ТекстБаннераРассылкиСообщений(Описание);
	ДанныеБаннера.ИмяКартинкиБаннера = КартинкаБаннераРассылкиСообщений(Описание);
	ДанныеБаннера.ИнтервалПроверкиСостоянияРассылкиСообщений = ИнтервалОбновленияБаннераРассылкиСообщений(Описание);
	ДанныеБаннера.ЦветБаннера = ЦветБаннераРассылкиСообщений(Описание);
	Если Не Описание.ФормаСостоянияРассылкиСообщений Тогда
		ДанныеБаннера.КартинкаЗакрытьБаннер = ВыводитьКартинкуЗакрытьБаннерРассылкиСообщений(Описание);
	КонецЕсли;
	
	ДанныеБаннера.РассылкаЗавершена = (Описание.ВОчередиНаОтправку = 0);
	
	Возврат ДанныеБаннера;
	
КонецФункции

Функция ТекстБаннераРассылкиСообщений(Описание)
	
	Отступ = "    ";

	ЭлементыСообщения = Новый Массив;
	Если Описание.Отправлено > 0 Тогда
		ЭлементыСообщения.Добавить(СтрШаблон(НСтр("ru = 'Отправлено: %1'"), Описание.Отправлено));
	КонецЕсли;
	Если Описание.ВОчередиНаОтправку > 0 Тогда
		ЭлементыСообщения.Добавить(СтрШаблон(НСтр("ru = 'В очереди на отправку: %1'"), Описание.ВОчередиНаОтправку));
	КонецЕсли;
	Если Описание.НеУдалосьОтправить > 0 Тогда
		ЭлементыСообщения.Добавить(СтрШаблон(НСтр("ru = 'Не удалось отправить: %1'"), Описание.НеУдалосьОтправить));
	КонецЕсли;
	
	ТекстСообщения = СтрСоединить(ЭлементыСообщения, Отступ);
	
	ЧастиТекста = Новый Массив;
	Если Описание.ФормаСостоянияРассылкиСообщений И Описание.СледующаяПопытка > ТекущаяДатаСеанса() И Описание.ВОчередиНаОтправку > 0 Тогда
		ЧастиТекста.Добавить(СтрШаблон(НСтр("ru = 'Возможно, на вашем почтовом сервере достигнут лимит отправки сообщений. Рассылка продолжится %1.'"), Формат(Описание.СледующаяПопытка, "ДЛФ=D")));
		ЧастиТекста.Добавить(Символы.ПС);
	ИначеЕсли Описание.ВОчередиНаОтправку = 0 Тогда
		ЧастиТекста.Добавить(СтрШаблон(НСтр("ru = 'Рассылка сообщений от %1 завершена.'"), Формат(Описание.ДатаРассылки, "ДЛФ=D")));
		ЧастиТекста.Добавить(Отступ);
	Иначе
		ЧастиТекста.Добавить(СтрШаблон(НСтр("ru = 'Рассылка сообщений от %1.'"), Формат(Описание.ДатаРассылки, "ДЛФ=D")));
		ЧастиТекста.Добавить(Отступ);
	КонецЕсли;
	
	Если Не Описание.ФормаСостоянияРассылкиСообщений Тогда
		// Подробное описание будет при переходе по ссылке на форму состояния рассылки
		ЧастиТекста.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения, , , , "ОткрытьФормуСостоянияРассылкиСообщений"));
	Иначе
		ЧастиТекста.Добавить(ТекстСообщения);
	КонецЕсли;
	
	// Если рассылка не завершена, то добавляем дату возобновления рассылки
	Если Не Описание.ФормаСостоянияРассылкиСообщений И Описание.СледующаяПопытка > ТекущаяДатаСеанса() И Описание.ВОчередиНаОтправку > 0 Тогда
		ЧастиТекста.Добавить(Отступ);
		ЧастиТекста.Добавить(СтрШаблон(НСтр("ru = 'Прервана. Возобновление: %1'"), Формат(Описание.СледующаяПопытка, "ДФ='dd.MM.yy HH:mm'; ДЛФ=;")));
	КонецЕсли;

	Возврат Новый ФорматированнаяСтрока(ЧастиТекста);

КонецФункции

Функция КартинкаБаннераРассылкиСообщений(Описание)
	
	КартинкаБаннера = "";
	
	Если Описание.СледующаяПопытка > ТекущаяДатаСеанса() И Описание.ВОчередиНаОтправку > 0 Тогда
		КартинкаБаннера = "Внимание16";
	ИначеЕсли Описание.ВОчередиНаОтправку > 0 Тогда
		КартинкаБаннера = "СинхронизацияДанныхДлительнаяОперация";
	Иначе
		КартинкаБаннера = "СинхронизацияДанныхДанныеПолучены";
	КонецЕсли;
	
	Возврат КартинкаБаннера;
	
КонецФункции

Функция ЦветБаннераРассылкиСообщений(Описание)
	
	Если Описание.ВОчередиНаОтправку > 0 Тогда
		ЦветБаннера = ЦветаСтиля.ЦветБаннераБежевый;
	Иначе
		ЦветБаннера = ЦветаСтиля.ЦветБаннераЗеленый;
	КонецЕсли;
	
	Возврат ЦветБаннера;
	
КонецФункции

Функция ВыводитьКартинкуЗакрытьБаннерРассылкиСообщений(Описание)
	
	Возврат Описание.ВОчередиНаОтправку = 0;
	
КонецФункции

Функция ИнтервалОбновленияБаннераРассылкиСообщений(Описание)
	
	Если Описание.СледующаяПопытка > ТекущаяДатаСеанса() И Описание.ВОчередиНаОтправку > 0 Тогда
		// Если отправка продолжится завтра, то баннер обновляем редко, раз в час
		ИнтервалПроверкиСостоянияРассылкиСообщений = 3600;
	ИначеЕсли Описание.ВОчередиНаОтправку > 0 Тогда
		ИнтервалПроверкиСостоянияРассылкиСообщений = 5;
	Иначе
		// Баннер о том, что рассылка завершена, обновлять не нужно
		ИнтервалПроверкиСостоянияРассылкиСообщений = 0;
	КонецЕсли;
	
	Возврат ИнтервалПроверкиСостоянияРассылкиСообщений;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
